Tekla.Structures.Drawing.CurvedDimensionSetRadial
The CurvedDimensionSetRadial class defines a curved dimension set with radial reference lines.
The following code asks the user to pick three points and then creates a
dimension between the points with a 50 mm distance:
using Tekla.Structures.Drawing;
using Tekla.Structures.Drawing.UI;
using Tekla.Structures.Geometry3d;
public class Example
{
static void PickPoints(int numberToPick, ref PointList pointList, ref ViewBase view)
{
Picker picker = new DrawingHandler().GetPicker();
Point point;
while (--numberToPick != -1)
{
picker.PickPoint("Pick point", out point, out view);
pointList.Add(point);
}
}
static void CreateDimension()
{
double Distance = 50.0;
PointList pointList = new PointList();
ViewBase view = null;
PickPoints(3, ref pointList, ref view);
new CurvedDimensionSetHandler().CreateCurvedDimensionSetRadial(view,
pointList[0],
pointList[1],
pointList[2],
pointList,
Distance);
}
}

Tekla.Structures.Drawing.CurvedDimensionSetRadial.Attributes
The curved dimension set radial attributes.

Tekla.Structures.Drawing.CurvedDimensionSetRadial.QueryOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Communicates with Tekla Structures core.
OperationType: The type of the executed operation.
Returns: True on success.

Tekla.Structures.Drawing.CurvedDimensionSetRadial.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.